IdeaRS.OpenModel.Concrete.TimePoint
Point on time axis

IdeaRS.OpenModel.Concrete.TimePoint.#ctor
Constructor

IdeaRS.OpenModel.Concrete.TimePoint.Name
Name of time point

IdeaRS.OpenModel.Concrete.TimePoint.Time
Time

IdeaRS.OpenModel.Concrete.TimePoint.Description
Description

IdeaRS.OpenModel.Concrete.TimePoint.Stage
Stage

IdeaRS.OpenModel.Concrete.TimePoint.Age
Age

IdeaRS.OpenModel.Concrete.TimePoint.Prestressing
Prestressing

IdeaRS.OpenModel.Concrete.TimePoint.LastConstructionStage
Last construction stage - Time of the start of cyclic loading for fatigue check

IdeaRS.OpenModel.Concrete.TimePoint.AllowCheckInAgeLess3Days
true to allow chec in age less 3 days

IdeaRS.OpenModel.Concrete.TimePoint.Fix2DRotation
true to fix around Y axis ( Mz is not taken into account )